Repository: wocsa/cyberjutsu
Catalog: locale/*/LC_MESSAGES/cyberjutsu.po
Languages: fr_fr, ja_jp

source: At that time, <b>each man presented his art as a collection of techniques</b>. <b>None perceived the guiding principle behind</b> jujutsu. This led me to look for an underlying principle in jujutsu, one that applied when one hit an opponent as well as when one threw him. I discerned an <b>all-pervasive principle</b>: to <b>make the most efficient use of mental and physical energy</b>. With this principle in mind, I reviewed all the methods of attack and defense I had learned, retaining only those that were in accordance with this principle. Those not in accord I rejected, and in their place I substituted techniques in which the principle was correctly applied. Judo <b>is more than an art of attack and defense. It is a way of life.</b>
ja_jp: 手

source: -- <cite>Chapter 1 Jujutsu Become Judo, Kodokan Judo Book, Jigoro Kano</cite>
ja_jp: 指を1本ずつ前後に転がす（両手、×5）

source: Japanese Martial Precepts embedded in Cyberjūtsu
fr_fr: French Translation of 'Japanese Martial Precepts embedded in Cyberjūtsu'
ja_jp: 親指で自分の全ての指に触れる（両手、前後、×2）

source: From the Karate Shōtōkan nijū kun
fr_fr: French Translation of 'From the Karate Shōtōkan nijū kun'
ja_jp: 同じ指を一緒に組み、その後一つずつ離す（両手、前後、×2）

source: 技術より心術
fr_fr: French Translation of '技術より心術'
ja_jp: 先生が数字（1から5）を言い、それに関連する指を離す

source: Spirit first, technique second.
fr_fr: French Translation of 'Spirit first, technique second.'
ja_jp: 結びつける

source: -- <cite>Gichin Funakoshi</cite>
fr_fr: French Translation of '-- <cite>Gichin Funakoshi</cite>'
ja_jp: パートナーと一緒に、Toruが指を動かし、Ukeは目で追う必要がある

source: 先づ自己を知れ而して他を知れ
fr_fr: French Translation of '先づ自己を知れ而して他を知れ'
ja_jp: 読み技

source: Know yourself first, and then others
fr_fr: French Translation of 'Know yourself first, and then others'
ja_jp: 約束稽古

source: 敵に因って轉化せよ
fr_fr: French Translation of '敵に因って轉化せよ'
ja_jp: Toruがランダムにポートをスキャンし、Ukeが数字を推測する。しばらくしたら、役割を交換する。

source: Victory depends on your ability to distinguish vulnerable points from invulnerable ones
ja_jp: ログ監視

source: 戦は虚実の操縦如何に在り
fr_fr: French Translation of '戦は虚実の操縦如何に在り'
ja_jp: ToruとUkeが2つのCLIの画面を分割する

source: The battle is according to how you maneuver guarded, unguarded Move according to your opponent
ja_jp: 新しい段落が提示された場合はリターンキーを押す。*Ctrl+a*を押して*Ctrl+|*を押して画面を2つに分割する。*Ctrl+a*を押して*Tab*を押して次の画面に切り替える。*Ctrl+a*を押して*Ctrl+c*を押して黒い画面にBash CLIを作成する

source: 常に思念工夫せよ
fr_fr: French Translation of '常に思念工夫せよ'
ja_jp: 読み技ログ監視を起動する

source: Always think and devise ways to live the precepts every day
fr_fr: French Translation of 'Always think and devise ways to live the precepts every day'
ja_jp: *Ctrl+a*を押して*Tab*を押して利用可能なCLIに戻る

source: 道場のみの空手と思ふな
fr_fr: French Translation of '道場のみの空手と思ふな'
ja_jp: リモートターミナルセッション検知

source: Do not think that karate training is only in the dojo
fr_fr: French Translation of 'Do not think that karate training is only in the dojo'
ja_jp: Uke

source: From Jūdō
fr_fr: French Translation of 'From Jūdō'
ja_jp: UkeはToriのサイバーデッキをスキャンし、sshポートを特定する

source: Enter by the technique, progress to the principle.
fr_fr: French Translation of 'Enter by the technique, progress to the principle.'
ja_jp: Ukeはssh経由でToriのサイバーデッキに接続する

source: -- <cite>Jigorō Kanō</cite>
fr_fr: French Translation of '-- <cite>Jigorō Kanō</cite>'
ja_jp: そして、Toriの練習中にコマンドを実行する

source: It is not important to be better than someone else, but to be better than yesterday.
ja_jp: 例：

source: Conduct kata and randori with your best effort.
fr_fr: French Translation of 'Conduct kata and randori with your best effort.'
ja_jp: Tori

source: Do not forget that the objective of jūdō study is to improve every day, not to win or lose.
ja_jp: ToriはYomi Wazaログ監視を確認し、右側の画面でのUkeのssh接続を捉える

source: Jūdō practice is not limited to the dōjō.
fr_fr: French Translation of 'Jūdō practice is not limited to the dōjō.'
ja_jp: Toriはアクティブなセッションをリストして、Ukeのssh接続に関連するTTYを特定する

source: It is necessary to consider others’ reactions to you in your self-reflection.
ja_jp: プロセス終了

source: From Aïkido
fr_fr: French Translation of 'From Aïkido'
ja_jp: ToriはYomi Wazaログを確認し、右側の画面でのUkeのssh接続を捉える

source: Sources
fr_fr: French Translation of 'Sources'
ja_jp: Toriはプロセスをリストして、`Ss`で始まるSTAT値に関連するPIDを特定する

source: [Niju Kun](https://fska.com/?page_id=186) -- Funakoshi Shotokan Karate Association
ja_jp: ToriはPIDを用いてプロセスを終了させ、そしてUkeをサイバーデッキから切断する

source: [The Untold History of Modern Japan and Japanese Martial Arts](https://kanochronicles.com/author/lgatling77/) -- Lance Gatling
ja_jp: Ukeが接続を行う

source: Forms or Kata (形)
fr_fr: French Translation of 'Forms or Kata (形)'
ja_jp: ToriはUkeと同時に接続を行う

source: Fight rules
fr_fr: French Translation of 'Fight rules'
ja_jp: ToriはUkeのローカルセッションに対してプロセス終了を行う

source: Environment
fr_fr: French Translation of 'Environment'
ja_jp: 投げ込み（パートナーとの運動による、×10）

source: Place of the combat
fr_fr: French Translation of 'Place of the combat'
ja_jp: 誠

source: The [Dojo](./glossary.md#dojo) is a closed network disconnected from other networks where only [cyberjutsuka](./glossary.md#cyberjutsuka) are connected through their [cyberdeck](./glossary.md#cyberdeck). It is recommended but not mandatory that practitioners are facing in the same physical room to ensure equal meanings and conditions. Arbiter must be able to control conditions and meaning of each [cyberjutsuka](./glossary.md#cyberjutsuka) to ensure equality in the practice.
ja_jp: 礼儀

source: Arbiter
fr_fr: French Translation of 'Arbiter'
ja_jp: 名誉

source: Arbiter is in charge to ensure safety and integrity of systems that are not engaged in the fight in and out of the dojo. Only cyberdeck of [cyberjutsuka](./glossary.md#cyberjutsuka) engaged in the fight can be attacked and impacted. Arbiter must ensure equality of chance, condition, meaning between [cyberjutsuka](./glossary.md#cyberjutsuka) engaged in the fight. Arbiter must ensure that [cyberjutsuka](./glossary.md#cyberjutsuka) allow sparring to fight properly.
ja_jp: 謙虚

source: Etiquette
fr_fr: French Translation of 'Etiquette'
ja_jp: 自制

source: General Greetings
fr_fr: French Translation of 'General Greetings'
ja_jp: 互助

source: When entering in the space (physical or digital) of the dojo, the [cyberjutsuka](./glossary.md#cyberjutsuka) greet the space(s) by physical bow called Ritsu [Rei](./glossary.md#rei) or written [rei](./glossary.md#rei).
ja_jp: 忍耐

source: Training etiquette
fr_fr: French Translation of 'Training etiquette'
ja_jp: 節操

source: General training etiquette
fr_fr: French Translation of 'General training etiquette'
ja_jp: 厚情

source: Cyberjutsuka listens to the Sensei and wait him to finish before interrupting or asking question
ja_jp: 2024年のhttp://thcon.partyのためのサイバー術短期発見コース

source: Cyberjutsuka asks the Sensei to be away from the dojo, before leaving it during the training (even temporarily)
ja_jp: 挨拶

source: Cyberjutsuka asks the Sensei to enter the dojo, during the training.
fr_fr: French Translation of 'Cyberjutsuka asks the Sensei to enter the dojo, during the training.'
ja_jp: 自分のサイバー術家が誰かと練習する前に、立ち合いに行う挨拶は、立礼または「お願いします」という言葉です。

source: Cyberjutsuka wait for the order of the Sensei to enter in the dojo or use the cyberdeck before entering in.
ja_jp: ウォームアップ

source: Cyberjutsuka wait for the order of the Sensei to leave the dojo before leaving it or shutdown the cyberdeck.
ja_jp: 目

source: Cyberjutsuka execute orders from the Sensei.
fr_fr: French Translation of 'Cyberjutsuka execute orders from the Sensei.'
ja_jp: 右上、左下、右下、左上を見る（×5）

source: Greeting before the training
fr_fr: French Translation of 'Greeting before the training'
ja_jp: 両目で円を描く（×5）

source: Everyone stand formally (arms close to the body, feet close, head straight) behind his cyberdeck facing the Sensei or if it's not physical everyone communicate "Onegaishimasu" to the Sensei
ja_jp: 目で∞を描く（×5）

source: When Sensei communicates "Otagai Ni [Rei](./glossary.md#rei)" to the audience, cyberjutsuka perform physical bow called Ritsu [Rei](./glossary.md#rei) or answer with [Rei](./glossary.md#rei) word together.
ja_jp: 手

source: When Sensei communicates "Sensei Ni [Rei](./glossary.md#rei)" to the audience, cyberjutsuka perform physical bow called Ritsu [Rei](./glossary.md#rei) or answer with [Rei](./glossary.md#rei) word together.
ja_jp: 両手の指を前後に一本ずつ転がす（×5）

source: Greeting after the training
fr_fr: French Translation of 'Greeting after the training'
ja_jp: 両手の親指で指全体に触れる（前後2回）

source: When Sensei communicates "[Sore made](./glossary.md#sore-made)" cyberjutsuka stand formally (arms close to the body, feet close, head straight) behind his cyberdeck facing the Sensei or if it's not physical everyone communicate "Domo arigato" to the Sensei.
ja_jp: 両手の同じ指を結び、1つずつ前後に外し（×2）

source: When Sensei communicates "[Mokuso](./glossary.md#mokuso)" cyberjutsuka close eyes and perform introspect moment to integrate experience and knowledge acquired during the training.
ja_jp: 先生の番号（1から5）を聞いて関連する指を外す

source: When Sensei communicates "[Mokuso](./glossary.md#mokuso) yame" cyberjutsuka open eyes and prepare for [Rei](./gloassy.md#rei).
ja_jp: 組み合わせ

source: Sparring rules
fr_fr: French Translation of 'Sparring rules'
ja_jp: パートナーのとりが指を動かし、受けが目で追う

source: Before the sparring
fr_fr: French Translation of 'Before the sparring'
ja_jp: 読み技

source: Arbiter call first sparring by showing him with hand or giving his name or nickname, then the second one (same way)
ja_jp: 約束稽古

source: first called partner will be called "aka"(赤) during the sparring
fr_fr: French Translation of 'first called partner will be called "aka"(赤) during the sparring'
ja_jp: とりがランダムにポートをスキャンし、受けが番号を推測する。しばらくしてから役割を交換する。

source: second called partner will be called "shiro" (白) during the sparring
fr_fr: French Translation of 'second called partner will be called "shiro" (白) during the sparring'
ja_jp: ログモニタリング

source: Cyberjutsuka perform general geetingsCyberjutsuka connect to the dojo or switch on their cyberdeck together
ja_jp: とりと受けは2つのcli画面を分割する

source: Cyberjutsuka greeting the dojo
fr_fr: French Translation of 'Cyberjutsuka greeting the dojo'
ja_jp: 段落が提示された場合はリターンを押す。2つの部分に画面を分割するためには*Ctrl+a*、*Ctrl+|*を押す。次の画面に切り替えるためには*Ctrl+a*、*Tab*を押す。黒い部分のbash cliを作成するためには*Ctrl+a*、*Ctrl+c*を押す。

source: Cyberjutsuka greeting the arbiter
fr_fr: French Translation of 'Cyberjutsuka greeting the arbiter'
ja_jp: 読み技ログを監視する

source: Cyberjutuska stand behind his cyberdeck facing the sparring partner
fr_fr: French Translation of 'Cyberjutuska stand behind his cyberdeck facing the sparring partner'
ja_jp: *Ctrl+a*、*Tab*で利用可能なcliに戻る

source: Arbiter communicate [Rei](./glossary.md#rei) then partners bow facing each other or answer [Rei](./glossary.md#rei)
ja_jp: リモート端末セッション検出

source: Arbiter communicate [Hajime](./gloassry.md#hajime) then partners start to fight
ja_jp: 受け

source: After the sparring
fr_fr: French Translation of 'After the sparring'
ja_jp: 受けはとりのサイバーデッキをスキャンし、sshポートを特定する

source: Arbiter communicate [Soremade](./gloassry.md#sore-made) for the end of the sparring then partners stop to fight (no more actions on the cyberdeck) then stand in formal way in front of each other
ja_jp: 受けはsshを介してとりのサイバーデッキに接続する

source: Arbiter communicate the winner by raising hand in direction of the winner or communicate "aka" (赤) or "shiro"(白) "shōsha" (勝者)
ja_jp: そして、とりの練習中にコマンドを実行する

source: Arbiter communicate [Rei](./glossary.md#rei) and partners bow facing each other or answer [Rei](./glossary.md#rei)
ja_jp: 例：

source: Cyberjutsuka [Rei](./glossary.md#rei) for the dojo a second time then leave the dojo (disconnect or shutdown the cyberdeck)
ja_jp: とり

source: During the sparring
fr_fr: French Translation of 'During the sparring'
ja_jp: とりは読み技ログを見て、受けのssh接続をキャッチする（画面の右側から）

source: When arbiter communicate "mate" partners stop actions and come back to beginning position (clear prompt no running commands/actions remaining)
ja_jp: とりはアクティブなセッションをリストして、受けのssh接続に関連するTTYを特定する

source: When arbiter communicate "sonomama" partners must keep the current situation without performing new actions.
ja_jp: プロセス終了

source: When arbiter communicate "hajime" partners resume the fight.
fr_fr: French Translation of 'When arbiter communicate "hajime" partners resume the fight.'
ja_jp: とりは読み技ログで、受けのssh接続をキャッチする（画面の右側から）

source: Arbiter can provide penalties to the cyberjutsuka if rules are broken by communicating "shido" and showing the partner or giving his color.
ja_jp: とりはプロセスをリストし、STAT値が`Ss`で始まるTTYに関連するPIDを特定する

source: cyberjutsuka must permit the fight to be performed
fr_fr: French Translation of 'cyberjutsuka must permit the fight to be performed'
ja_jp: とりはプロセスの参照識別子（PID）でプロセスを終了し、受けをサイバーデッキから切断する

source: cyberdeck must be ready for the sparring during all the fight
fr_fr: French Translation of 'cyberdeck must be ready for the sparring during all the fight'
ja_jp: 受けが接続を行う

source: cyberdeck must have identical hardware, software and configuration at the beginning of the fight
ja_jp: とりが受けと同時に接続を行う

source: services on cyberdeck must be available on ports and fully functional
fr_fr: French Translation of 'services on cyberdeck must be available on ports and fully functional'
ja_jp: とりが（プロセス終了）をローカルセッションで実行する（day1.md#process-termination-d3-pt）

source: credentials on cyberdeck (e.g:login/password) must be the one allowed only
ja_jp: 投げ込み（パートナーによる運動×10）

source: cyberdeck must respect rules of the dojo (network rules in terms of addressing, communication standards,...)
ja_jp: 受けのローカルセッションを終了する

source: partner can not be blocked during a period only one time block are allowed
ja_jp: エチケット（礼儀）

source: cyberjutsuka can not perform action in the time that prevent partner to perform attacks
ja_jp: 名誉（Meiyo）

source: cyberjutsuka must fightcyberjutsuka can not avoid intentionally the fight
ja_jp: 謙虚（Kenkyo）

source: cyberjutsuka can not have only defensive posture
fr_fr: French Translation of 'cyberjutsuka can not have only defensive posture'
ja_jp: 自制（Shisei）

source: cyberjutsuka can not perform only fake attacks as offensive actions
fr_fr: French Translation of 'cyberjutsuka can not perform only fake attacks as offensive actions'
ja_jp: 互助（Gojo）

source: Glossary of Terms
fr_fr: French Translation of 'Glossary of Terms'
ja_jp: 忍耐（Nintai）

source: Most of terms related to computer or technical elements are get from computer science and cybersecurity.
ja_jp: 節操（Sessō）

source: Most of terms related to methods, way of work, mindset, rules are get from japanese martial arts (budō).
ja_jp: 厚情（Kojo）

source: Martial Arts Terms used in Cyberjūtsu
fr_fr: French Translation of 'Martial Arts Terms used in Cyberjūtsu'
ja_jp: http://thcon.party 2024のためのサイバージュツの短い発見コース

source: <a name="dojo">Dojo</a> 道場 (Practice space)
fr_fr: French Translation of '<a name="dojo">Dojo</a> 道場 (Practice space)'
ja_jp: 挨拶

source: Where Cyberjūtsu is practiced by Cyberjūtsuka through Cyberdeck (usually an isolated network)
ja_jp: サイバージュツカが誰かと練習をする前に、彼には「リツ（礼）」と呼ばれる物理的なお辞儀か「お願いします」という文句で挨拶しなさい

source: <a name="cyberjutsuka">Cyberjutsuka</a> サイバー術家 (Practitioner)
fr_fr: French Translation of '<a name="cyberjutsuka">Cyberjutsuka</a> サイバー術家 (Practitioner)'
ja_jp: ウォームアップ

source: A Cyberjūtsu practitioner
fr_fr: French Translation of 'A Cyberjūtsu practitioner'
ja_jp: 目

source: <a name="sensei">Sensei</a> 先生 (instructor)
fr_fr: French Translation of '<a name="sensei">Sensei</a> 先生 (instructor)'
ja_jp: 右上、左下、右下、左上を見る（5回）

source: Master of cyberjutsu. Instructor of the course.
fr_fr: French Translation of 'Master of cyberjutsu. Instructor of the course.'
ja_jp: 両目で円を描く（5回）

source: <a name="waza">Waza</a> 技 (technique)
fr_fr: French Translation of '<a name="waza">Waza</a> 技 (technique)'
ja_jp: 目で∞印を描く（5回）

source: A Cyberjūtsu technique
fr_fr: French Translation of 'A Cyberjūtsu technique'
ja_jp: 手

source: <a name="uke">Uke</a> 受け (defender,receiver)
fr_fr: French Translation of '<a name="uke">Uke</a> 受け (defender,receiver)'
ja_jp: 両手の指を一つずつ前後に転がす（5回）

source: The Cyberjūtsuka who receive or defend against the action
fr_fr: French Translation of 'The Cyberjūtsuka who receive or defend against the action'
ja_jp: 両手の親指でそれぞれの指に触れる（前後に2回ずつ）

source: <a name="tori">Tori</a> 取り (attacker,taker)
fr_fr: French Translation of '<a name="tori">Tori</a> 取り (attacker,taker)'
ja_jp: 同じ指同士を組み合わせて片方ずつ前後に離す（2回）

source: The Cyberjūtsuka who lead or perform the objective.
fr_fr: French Translation of 'The Cyberjūtsuka who lead or perform the objective.'
ja_jp: 先生の指定した数（1から5まで）を聞いて関連する指を離す

source: <a name="uke-waza">Uke Waza</a> 受け技 (defense technique)
fr_fr: French Translation of '<a name="uke-waza">Uke Waza</a> 受け技 (defense technique)'
ja_jp: 連携した

source: Category of Cyberjūtsu techniques to defend
fr_fr: French Translation of 'Category of Cyberjūtsu techniques to defend'
ja_jp: パートナーと一緒に指を動かし、相手は目で追う

source: <a name="kogeki-waza">Kōgeki Waza</a> 攻撃技 (attack technique)
fr_fr: French Translation of '<a name="kogeki-waza">Kōgeki Waza</a> 攻撃技 (attack technique)'
ja_jp: ヨミ技

source: Category of Cyberjūtsu techniques to attack
fr_fr: French Translation of 'Category of Cyberjūtsu techniques to attack'
ja_jp: 約束稽古

source: <a name="suki">Suki</a> 隙技 (weakness,opening)
fr_fr: French Translation of '<a name="suki">Suki</a> 隙技 (weakness,opening)'
ja_jp: トリがランダムに1つずつポートをスキャンし、ウケが番号を推測しようとする。しばらくしてから役割を交換する。

source: Opening or a Weakness in one's technique or posture
fr_fr: French Translation of 'Opening or a Weakness in one's technique or posture'
ja_jp: ログ監視

source: <a name="yomi-waza">Yomi Waza</a> 読み技 (monitoring technique)
fr_fr: French Translation of '<a name="yomi-waza">Yomi Waza</a> 読み技 (monitoring technique)'
ja_jp: トリとウケで2つのcliを分割画面で表示する

source: Category of Cyberjūtsu technique to monitor activity
fr_fr: French Translation of 'Category of Cyberjūtsu technique to monitor activity'
ja_jp: 段落が表示されたらリターンキーを押す。# 画面を2つに分割する*Ctrl+a*、次の画面に切り替える*Ctrl+a*、コマンドラインインターフェースを黒い画面に作成する*Ctrl+a*、ログ監視のヨミ技を起動する*Ctrl+a*、利用可能なcliに戻る*Ctrl+a*

source: Where Cyberjūtsu is practiced by Cyberjūtsuka
fr_fr: French Translation of 'Where Cyberjūtsu is practiced by Cyberjūtsuka'
ja_jp: リモート端末セッション検出[D3-RTSD]

source: <a name="rei">Rei</a> 礼 (welcome,respect)
fr_fr: French Translation of '<a name="rei">Rei</a> 礼 (welcome,respect)'
ja_jp: ウケ

source: Welcome others with respect before or after practicing, in physically it's done with bow *Ritsu Rei* or by *Rei* word when communicating.
ja_jp: ウケはトリのサイバーデッキのSSHポートを特定するためにポートをスキャンする

source: <a name="hadjime">Hadjime</a> はじめ (Beginning)
fr_fr: French Translation of '<a name="hadjime">Hadjime</a> はじめ (Beginning)'
ja_jp: ウケはSSH経由でトリのサイバーデッキに接続する

source: Beginning of the activity
fr_fr: French Translation of 'Beginning of the activity'
ja_jp: その後、トリの練習中にコマンドを実行する。

source: <a name="matte">Matte</a> 待て (Stop,Break)
fr_fr: French Translation of '<a name="matte">Matte</a> 待て (Stop,Break)'
ja_jp: 例：

source: Stop, break of the activity
fr_fr: French Translation of 'Stop, break of the activity'
ja_jp: トリ

source: <a name="sono-mama">Sono mama</a> 其のまま (Freeze
fr_fr: French Translation of '<a name="sono-mama">Sono mama</a> 其のまま (Freeze'
ja_jp: ヨミ技のログ監視を見て、ウケのSSH接続をキャッチする（画面の右側から）

source: Freeze the situation. No action. Hold the position.
fr_fr: French Translation of 'Freeze the situation. No action. Hold the position.'
ja_jp: アクティブなセッションをリストして、ウケのSSH接続に関連するTTYを特定する

source: <a name="sore-made">Sore made</a> 其れ迄に (End)
fr_fr: French Translation of '<a name="sore-made">Sore made</a> 其れ迄に (End)'
ja_jp: プロセスの終了[D3-PT]

source: End of the activity
fr_fr: French Translation of 'End of the activity'
ja_jp: ヨミ技のログを見て、ウケのSSH接続をキャッチする（画面の右側から）

source: <a name="ippon">Ippon</a> 一本 (Knockout)
fr_fr: French Translation of '<a name="ippon">Ippon</a> 一本 (Knockout)'
ja_jp: プロセスを一覧表示して、STAT値が`Ss`で始まるTTYに関連するPIDを特定する

source: Ippon is the highest score a fighter can achieve in a Japanese martial arts (judo, karate or jujitsu)
ja_jp: プロセスをその参照識別子（PID）で終了させることで、セッションを終了し、ウケをサイバーデッキから切断する

source: <a name="oasaekomi">Osae Komi</a> 押さえ()込み (Full control)
fr_fr: French Translation of '<a name="oasaekomi">Osae Komi</a> 押さえ()込み (Full control)'
ja_jp: ウケが接続を行う

source: Take full control over the opponent. Usually this full control must be applied for a given duration to get an [Ippon](#ippon).
ja_jp: トリと同時にウケが接続を行う

source: <a name="kata">Kata</a> 形 (Forms)
fr_fr: French Translation of '<a name="kata">Kata</a> 形 (Forms)'
ja_jp: トリがウケのローカルセッションで*プロセス終了*を実行する

source: <b>Predefined sequence of attack and defense to demonstrate a concept.</b> Through the execution of Kata by partners they intend to demonstrate the maximum efficiency and effectiveness of their practice regarding the predefined sequences defined as
ja_jp: 投げ込み（パートナーによるエクササイズを10回）

source: <a name="randori">Randori</a> 乱取り (free practice or sparring)
fr_fr: French Translation of '<a name="randori">Randori</a> 乱取り (free practice or sparring)'
ja_jp: ウケのローカルセッションを終了する

source: One to one sparring where partners attempt to resist and counter each other's techniques. *The term is used in aikido, judo, and Brazilian jiu-jitsu dojos outside Japan. In Japan, this form of practice is called taninzu-gake (多人数掛け), which literally means multiple attackers. In karate the word kumite is usually used.* [wikipedia](https://en.wikipedia.org/wiki/Randori)
ja_jp: 偽のサービスリスニング

source: <a name="uchikomi">Uchikomi</a> 打ち込み (Repetition training)
fr_fr: French Translation of '<a name="uchikomi">Uchikomi</a> 打ち込み (Repetition training)'
ja_jp: 名誉

source: Repeated [waza](#waza) practice with a partner
fr_fr: French Translation of 'Repeated [waza](#waza) practice with a partner'
ja_jp: 謙虚

source: <a name="nagekomi">Nagekomi</a> 打ち込み (Repetition training)
fr_fr: French Translation of '<a name="nagekomi">Nagekomi</a> 打ち込み (Repetition training)'
ja_jp: 自制

source: Repeated [waza](#waza) practice with a partner including [kake](#tsukuri-kusushi-kake)
ja_jp: 互助

source: <a name="yakusoku-geiko">Yakusoku geiko</a> 約束稽古 (agreed-upon practice)
fr_fr: French Translation of '<a name="yakusoku-geiko">Yakusoku geiko</a> 約束稽古 (agreed-upon practice)'
ja_jp: 忍耐

source: Predefined sequence or rules to execute with a partner in a dynamic and continuous way.
ja_jp: 節操

source: <a name="seiryoku-zen-yo">Seiryoku zen yo</a> 精力最活用 (Maximum efficiency)
fr_fr: French Translation of '<a name="seiryoku-zen-yo">Seiryoku zen yo</a> 精力最活用 (Maximum efficiency)'
ja_jp: 厚情

source: <b>Maximum efficiency with the minimum effort.</b> Use effective and relevant combination of will, technique and body adapted to the moment to get the maximum expected effect with the minimum of energy.
ja_jp: http://thcon.party 2024に向けたサイバー術入門コース

source: <a name="jita-koei">Jita Kyôei</a> 自他共栄 (Mutual aid)
fr_fr: French Translation of '<a name="jita-koei">Jita Kyôei</a> 自他共栄 (Mutual aid)'
ja_jp: 挨拶

source: <b>Harmony</b> and <b>cooperation</b> is, in other words, the concept of Jita-Kyoei, or <b>mutual prosperity for self and others</b>.
ja_jp: 練習前、サイバー術家が他の人と練習する前に、リツ（礼）または「お願いします」という言葉と共に物理的なお辞儀をします

source: <a name=""></a> 単独練習 (practising his scales and mastering)
fr_fr: French Translation of '<a name=""></a> 単独練習 (practising his scales and mastering)'
ja_jp: ウォームアップ

source: Shadow training to practice alone in order to improve your skills by imagining partner and situations.
ja_jp: 目

source: <a name="tsune">Tsune</a> 常 (training habits)
fr_fr: French Translation of '<a name="tsune">Tsune</a> 常 (training habits)'
ja_jp: 右上、左下、右下、左上を見る（5回）

source: <b>Continuous practice as a permanent ritual to make progress.</b> Take time to learn techniques properly, improve your practice with partners, transform practice into habits.
ja_jp: 両方の目で円を描く（5回）

source: <a name="shuhari">Shuhari</a> 守破離 (apply,detach,transcend)
fr_fr: French Translation of '<a name="shuhari">Shuhari</a> 守破離 (apply,detach,transcend)'
ja_jp: 目で∞の記号を描く（5回）
