Repository: wocsa/cyberjutsu
Catalog: locale/*/LC_MESSAGES/cyberjutsu.po
Languages: fr_fr, ja_jp

source: shu (守) "obey" learning fundamentals, techniques, heuristics, proverbs
fr_fr: French Translation of 'shu (守) "obey" learning fundamentals, techniques, heuristics, proverbs'
ja_jp: 手

source: ha (破) "detach", "digress" breaking with tradition—detachment from the illusions of self, to break with tradition - to find exceptions to traditional wisdom, to find new approaches.
ja_jp: 両手の指を一つずつ前後に転がす（5回）

source: ri (離) transcend, become the way, there are no techniques or proverbs, all moves are natural, becoming one with spirit alone without clinging to forms;
ja_jp: 両手の親指でそれぞれの指を前後に触れる（2回）

source: <a name="shin-gi-tai">Shin Gi Tai</a> 心技体 (mind,technique,fitness)
fr_fr: French Translation of '<a name="shin-gi-tai">Shin Gi Tai</a> 心技体 (mind,technique,fitness)'
ja_jp: 同じ指を組み合わせ、それぞれの指を前後に解除する（2回）

source: Shin represents mind, heart and good spirit. Gi represents skill, knowledge and experience. Tai represents the body and physical effort. Those 3 elements must be trained together in order to reach [Maximum efficiency](#seiryoku-zen-yo)
ja_jp: 先生が数字（1から5）を言ったら、関連する指を離す

source: <a name="tsukuri-kusushi-kake">Tsukuri Kuzushi Kake</a> 作り 崩し 懸け (construct/prepare, destroy/orient, exploit/execute)
ja_jp: 連携

source: Tsukuri means prepare or construct Kuzushi and Kake to reach your goal
fr_fr: French Translation of 'Tsukuri means prepare or construct Kuzushi and Kake to reach your goal'
ja_jp: パートナーと共に、toriは指を動かし、ukeは目でフォローする

source: Kuzushi means to destroy your opponent's posture to obtain the situation you expect
ja_jp: 読み技

source: Kake means exploit Kuzushi to execute your technique to reach your goal.
ja_jp: 約束稽古

source: <a name="mikiri">Mikiri</a> 見切る (perception)
fr_fr: French Translation of '<a name="mikiri">Mikiri</a> 見切る (perception)'
ja_jp: Toriはランダムに1つずつポートをスキャンし、Ukeはその番号を当てようとします。しばらくすると、役割が交換されます。

source: Evaluate opponent and identify opportunities and weaknesses. Observe moves and posture.
ja_jp: ログ監視

source: <a name="go-no-sen">Go No Sen</a> 後の先 (post-initiative)
fr_fr: French Translation of '<a name="go-no-sen">Go No Sen</a> 後の先 (post-initiative)'
ja_jp: ToriとUkeは、2つのcliで画面を分割します。

source: Combatant takes the initiative in a fight after the opponent has already started an attack.
ja_jp: 指示が表示されたらリターンを押します。*Ctrl+a*、*Ctrl+|*で画面を2つに分割します。*Ctrl+a*、*Tab*で画面の次の部分に切り替えます。*Ctrl+a*、*Ctrl+c*で画面の黒い部分にbash cliを作成します。

source: <a name="sen-no-sen">Sen No Sen</a> 先の先 (initiative)
fr_fr: French Translation of '<a name="sen-no-sen">Sen No Sen</a> 先の先 (initiative)'
ja_jp: 読み技ログ監視を開始します。

source: Start action in defense the moment you have an inkling of the offensive of your opponent
ja_jp: *Ctrl+a*、*Tab*で利用可能なcliに戻ります。

source: <a name="sen-sen-no-sen">Sen sen no sen</a> 先先の先 (superior initiative)
fr_fr: French Translation of '<a name="sen-sen-no-sen">Sen sen no sen</a> 先先の先 (superior initiative)'
ja_jp: リモート端末セッション検出

source: Superior initiative is given play in a delicate situation where one confronts an opponent who intends to attack and gains mastery over them by subtly guessing their mentality and forestalling their actions.
ja_jp: Ukeはtoriのサイバーデッキのsshポートを特定するためにポートをスキャンします。

source: <a name="mokuso">Mokusō</a> 黙想 (meditation,mind training)
fr_fr: French Translation of '<a name="mokuso">Mokusō</a> 黙想 (meditation,mind training)'
ja_jp: Ukeはssh経由でtoriのサイバーデッキに接続します。

source: Introspect moment to train mind and fix knowledge from experience practiced earlier or projection
ja_jp: その後、Toriの練習中にコマンドを実行します。

source: Cyber terms
fr_fr: French Translation of 'Cyber terms'
ja_jp: 例：

source: <a name="cyberdeck">Cyberdeck</a> (practitioner material)
fr_fr: French Translation of '<a name="cyberdeck">Cyberdeck</a> (practitioner material)'
ja_jp: Tori

source: Cyberdeck contain the same hardware and software for all practitioner in order to ensure the progression of people instead of software or hardware. A cyberdeck is composed by a screen, a computer, a keyboard, a network connection. See [cyberdeck project](https://github.com/wocsa/cyberdeck)
ja_jp: *Tori*は右側の画面で*Uke*のssh接続をキャッチするために読み技ログ監視を見ます。

source: <a name="port">Port</a> (network connection number)
fr_fr: French Translation of '<a name="port">Port</a> (network connection number)'
ja_jp: *Tori*はアクティブなセッションをリストアップして、*Uke*のssh接続に関連するTTYを特定します。

source: a port is a network port opened on cyberdeck to accept incoming connections
ja_jp: プロセス終了

source: <a name="cli">Command Line Interface</a> (cli)
fr_fr: French Translation of '<a name="cli">Command Line Interface</a> (cli)'
ja_jp: *Tori*は右側の画面で*Uke*のssh接続をキャッチするために読み技ログ監視を見ます。

source: command line interface is used by practitioner to read information and write commands to execute on the cyberdeck
ja_jp: *Tori*はプロセスをリストアップして、'Ss'で始まるSTAT値に関連するPIDを特定します。

source: <a name="command">Command</a>
fr_fr: French Translation of '<a name="command">Command</a>'
ja_jp: *Tori*はプロセスの識別子（PID）でプロセスを終了し、そのセッション、つまり*Uke*をサイバーデッキから切断します。

source: A command is a list of symbols and keywords written on the keyboard by the practitioner to give an order to the cyberdeck
ja_jp: Ukeが接続を実行します

source: <a name="log">Log</a>
fr_fr: French Translation of '<a name="log">Log</a>'
ja_jp: ToriがUkeと同じファージに接続を実行します

source: A log is a summary of an event on the cyberdeck that is written with keywords date and time
ja_jp: Toriが*Uke*のローカルセッションで(process termination)を実行します

source: External links
fr_fr: French Translation of 'External links'
ja_jp: Ukeのローカルセッションを10回終了します

source: [Kodokan Glossary](http://kodokanjudoinstitute.org/en/doctrine/word/)
fr_fr: French Translation of '[Kodokan Glossary](http://kodokanjudoinstitute.org/en/doctrine/word/)'
ja_jp: ウソのサービスリスニング

source: [Judo](https://en.wikipedia.org/wiki/Judo#Pedagogy) -- Wikipedia
fr_fr: French Translation of '[Judo](https://en.wikipedia.org/wiki/Judo#Pedagogy) -- Wikipedia'
ja_jp: *Tori*は*Uke*に利用可能なサービスを偽装するためにポートを開きます。

source: [Main Principles of Traditional Karate and technical applications](https://thetraditioncontinue.com/main-principles-of-traditional-karate-and-technical-applications/)
ja_jp: 謙虚 (Kenkyo)

source: [Sen (先) - Initiative](https://www.tomikiaikido.ie/go-no-sen-sen-no-sen)
ja_jp: 自制 (Shisei)

source: [FR: Lionel Froidure Blog](https://www.lionelfroidure.com) -- Lionel Froidure
ja_jp: 互助 (Gojo)

source: [FR: Tsune a matter of habits](https://www.lionelfroidure.com/tsune-karate-habitude/) -- Lionel Froidure
ja_jp: 忍耐 (Nintai)

source: [FR: Itsutsu no kata -logie](https://corpsjapon.hypotheses.org/) -- Yves Cadot
ja_jp: 節操 (Sessō)

source: [FR: Seiryoku zenyo](https://www.judopourtous.com/PagesAnnexees/SeiryokuZenyo.htm) -- Yves Cadot
ja_jp: 厚情 (Kojo)

source: [FR: Karate Do Terms](https://toulousekarate.clubeo.com/page/les-termes-utilises-en-japonais-en-karate-do.html)
ja_jp: Cyberjūtsu short discovery course for http://thcon.party 2024

source: [Aikido Glossary](https://www.martialartsplanet.com/threads/japanese-terms-with-kanji.59429/)
ja_jp: 挨拶 (Greeting)

source: [English](/) | [French](/langs/fr_FR/) | [Japanese](/langs/ja_JP/)
fr_fr: French Translation of '[English](/) | [French](/langs/fr_FR/) | [Japanese](/langs/ja_JP/)'
ja_jp: サイバー術者が他の人と実践する前に、深いお辞儀をしてリーボウまたは「お願いします」と言う。 (The cyberjutsuka before practicing with someone greet him with physical bow called Ritsu [Rei] or "Onegaishimasu" sentence)

source: Cyberjūtsu サイバー術
fr_fr: French Translation of 'Cyberjūtsu サイバー術'
ja_jp: ウォームアップ (Warmup)

source: Cyberjūtsu is a new way to teach cybersecurity inspired from modern japanese martial arts way 武道 (Budō).
ja_jp: 目 (Eyes)

source: Register to http://cyberjutsu.education for bootcamps or stages.
fr_fr: French Translation of 'Register to http://cyberjutsu.education for bootcamps or stages.'
ja_jp: 右上、左下、右下、左上を見ます (x5)

source: What is cyberjūtsu ?
fr_fr: French Translation of 'What is cyberjūtsu ?'
ja_jp: 目で円を描きます (x5)

source: Cyberjūtsu is a new way to teach cybersecurity inspired from modern japanese martial arts trainings (mostly judo, karate and jujitsu). It is an educational way which allows everyone (novice to expert) to practice together and improve themselves in cybersecurity through sparring. It follows budō 武道 (judo, jujitsu, karate...) principles and moral code similar to them. The goal is to reach "maximum-efficient use of body, mind and computer" in a "mutual benefit" of a human confrontation.
ja_jp: 目で∞印を描きます (x5)

source: Why do we apply martial arts to cybersecurity?
fr_fr: French Translation of 'Why do we apply martial arts to cybersecurity?'
ja_jp: 手 (Hands)

source: Martial Arts known benefits:
fr_fr: French Translation of 'Martial Arts known benefits:'
ja_jp: 両手で指を前後に1つずつ転がします (x5)

source: Improve coordination between mind and movements.
fr_fr: French Translation of 'Improve coordination between mind and movements.'
ja_jp: 両手の親指でそれぞれの指にさわります (x2)

source: Train to act in stressing situations.
fr_fr: French Translation of 'Train to act in stressing situations.'
ja_jp: 同じ指同士を結び、1つずつ前後に取り除きます (x2)

source: Develop fast and accurate reflexes.
fr_fr: French Translation of 'Develop fast and accurate reflexes.'
ja_jp: 先生の指示に従って関連する指を取り除きます (1から5まで)

source: Learn to improvise in unfamiliar events.
fr_fr: French Translation of 'Learn to improvise in unfamiliar events.'
ja_jp: 組み合わせ (Combined)

source: Teach a code of conduct. Learn to respect others.
fr_fr: French Translation of 'Teach a code of conduct. Learn to respect others.'
ja_jp: パートナーと指を動かし、後に目で追う (Tori move fingers with partner, uke must follow with the eyes)

source: There are plenty of other reasons.
fr_fr: French Translation of 'There are plenty of other reasons.'
ja_jp: ヨミ技 (Yomi Waza)

source: Waza 技 (technique)
fr_fr: French Translation of 'Waza 技 (technique)'
ja_jp: 約束稽古 (Yakusoku geiko)

source: Yomi Waza 読み技 (monitoring technique)
fr_fr: French Translation of 'Yomi Waza 読み技 (monitoring technique)'
ja_jp: Toriがランダムに1つずつポートをスキャンし、Ukeが数字を推測します。しばらくしたら、役割が交換されます。 (*Tori* try to scan ports one by one randomly and *Uke* try to guess the number. After a while roles are exchanged.)

source: read the manual
fr_fr: French Translation of 'read the manual'
ja_jp: ログ監視 (Log Monitoring)

source: get documentation about a command
fr_fr: French Translation of 'get documentation about a command'
ja_jp: ToriとUkeで画面を2つに分割します

source: know services name and their ports
fr_fr: French Translation of 'know services name and their ports'
ja_jp: Promptが出たらReturnキーを押します。 * Ctrl + a* 、* Ctrl + | *を押して画面を2つに分割します。*Ctrl+a* then *Tab*で画面の切替えができます。*Ctrl+a* then *Ctrl+c*を押して、黒い部分にbash cliを作成します。

source: sessions (who is doing what)
fr_fr: French Translation of 'sessions (who is doing what)'
ja_jp: ヨミ技ログ監視を起動します。 (Launch Yomi Waza Log Monitoring)

source: <a href="who">who</a>
fr_fr: French Translation of '<a href="who">who</a>'
ja_jp: 利用可能なcliに戻るために*Ctrl+a* then *Tab*を押します。 (*Ctrl+a* then *Tab* to return to available cli)

source: observe session
fr_fr: French Translation of 'observe session'
ja_jp: 遠隔端末セッション検出 (Remote Terminal Session Detection) [D3-RTSD](https://d3fend.mitre.org/technique/d3f:RemoteTerminalSessionDetection)

source: ports
fr_fr: French Translation of 'ports'
ja_jp: Uke

source: what port is doing what
fr_fr: French Translation of 'what port is doing what'
ja_jp: UkeはToriのサイバーデッキに接続し、sshポートを特定します。 (*Uke* scan port to *Tori* cyberdeck to identify ssh port)

source: processes
fr_fr: French Translation of 'processes'
ja_jp: UkeはToriのサイバーデッキにsshで接続し、Toriの練習中にコマンドを実行します。 (*Uke* connect via ssh to *Tori* cyberdeck, then run commands during *Tori* practice.)

source: list processes
fr_fr: French Translation of 'list processes'
ja_jp: 例:

source: filter & search
fr_fr: French Translation of 'filter & search'
ja_jp: Tori

source: browse
fr_fr: French Translation of 'browse'
ja_jp: Toriは右側の画面でUkeのssh接続をYomi Wazaログ監視してキャッチします。 (*Tori* look at Yomi Waza Log Monitoring to catch *Uke* ssh connection (from right side of the screen))

source: display content of a file
fr_fr: French Translation of 'display content of a file'
ja_jp: Toriはアクティブなセッションをリストし、*Uke*のssh接続に関連するTTYを特定します。 (Tori list active sessions to identify TTY related to *Uke* ssh connection.)

source: browse file content then press 'q' to quit use '/' to search keyword
fr_fr: French Translation of 'browse file content then press 'q' to quit use '/' to search keyword'
ja_jp: プロセス終了 (Process Termination) [D3-PT](https://d3fend.mitre.org/technique/d3f:ProcessTermination/)

source: read each newline coming into the file then press 'q' to quit
fr_fr: French Translation of 'read each newline coming into the file then press 'q' to quit'
ja_jp: Toriは右側の画面のYomi Waza Logを見て*Uke*のssh接続をキャッチします。 (Tori look at Yomi Waza Log to catch *Uke* ssh connection (from right side of the screen).)

source: filter
fr_fr: French Translation of 'filter'
ja_jp: Toriはプロセスのリストを表示し、*Uke*のssh接続に関連する`Ss`で始まるSTAT値のTTYに関連するPIDを特定します。 (*Tori* list processes to identify PID related to TTY with STAT value starting with `Ss`)

source: catch lines in a file with a given keyword
fr_fr: French Translation of 'catch lines in a file with a given keyword'
ja_jp: ToriはPIDでプロセスを終了させ、それによってセッションを終了し、*Uke*をサイバーデッキから切断します。 (*Tori* kill the processus by it reference identifier (PID), so the session, so disconnect *Uke* from his cyberdeck.)

source: logs
fr_fr: French Translation of 'logs'
ja_jp: 投げ込み（パートナーとのエクササイズで10回）

source: communications
fr_fr: French Translation of 'communications'
ja_jp: ukeのローカルセッションを終了させます (kill local session of the uke)

source: firewall Logging
fr_fr: French Translation of 'firewall Logging'
ja_jp: 偽のサービスのリスニング (Fake service listening)

source: record in syslog new connection incoming
fr_fr: French Translation of 'record in syslog new connection incoming'
ja_jp: ToriはUkeのために偽のサービスで利用可能なポートを開きます。 (*Tori* open a port to fake a service available for *Uke*)

source: record in syslog new connection outgoing
fr_fr: French Translation of 'record in syslog new connection outgoing'
ja_jp: UkeはToriの偽のサービスに偽のクライアントで接続します。 (*Uke* perform a connection with a fake client to the fake service of *Tori*)

source: content listening
fr_fr: French Translation of 'content listening'
ja_jp: 自制 (Shisei) 自制

source: Tori Waza 取り技 (attack technique)
fr_fr: French Translation of 'Tori Waza 取り技 (attack technique)'
ja_jp: 互助 (Gojo) 互助

source: discovery
fr_fr: French Translation of 'discovery'
ja_jp: 忍耐 (Nintai) 忍耐

source: network scan
fr_fr: French Translation of 'network scan'
ja_jp: 節操 (Sessō) 節操

source: Uke Waza</a> 受け技 (defense technique)
fr_fr: French Translation of 'Uke Waza</a> 受け技 (defense technique)'
ja_jp: 厚情 (Kojo) 厚情

source: sessions
fr_fr: French Translation of 'sessions'
ja_jp: 2024年のhttp://thcon.partyの短いサイバー術発見コース

source: kill session get tty with [who](yomi waza who) then
fr_fr: French Translation of 'kill session get tty with [who](yomi waza who) then'
ja_jp: 挨拶

source: Training methods
fr_fr: French Translation of 'Training methods'
ja_jp: 他の人との練習の前に、サイバージュツカは、リツ（Rei）または「お願いします」というフレーズで物理的なお辞儀をします。

source: BSD 3-Clause License
ja_jp: ウォームアップ

source: Copyright (c) 2013-2023, Kim Davies and contributors. All rights reserved.
ja_jp: 目

source: Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:
ja_jp: 右上、左下、右下、左上を見る（5回）

source: Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.
ja_jp: 両方の感覚で目で円を描く（5回）

source: Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.
ja_jp: 目で∞印を描く（5回）

source: Neither the name of the copyright holder nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.
ja_jp: 手

source: THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
ja_jp: 両手の指を前後に一つずつ巻く（5回）

source: Copyright © 2020, [Encode OSS Ltd](https://www.encode.io/). All rights reserved.
ja_jp: 両手の指で前後に一つずつ触れる（2回）

source: Copyright © 2019, [Encode OSS Ltd](https://www.encode.io/). All rights reserved.
ja_jp: 同じ指同士を組み合わせてから解除して、一つずつ前後に（2回）

source: ftp connection
fr_fr: French Translation of 'ftp connection'

source: watch activity
fr_fr: French Translation of 'watch activity'

source: pipe chain
fr_fr: French Translation of 'pipe chain'

source: events
fr_fr: French Translation of 'events'
