Repository: wocsa/cyberjutsu
Catalog: locale/*/LC_MESSAGES/cyberjutsu.po
Languages: fr_fr, ja_jp

source: Cyberjūtsu Grades (段位)
fr_fr: French Translation of 'Cyberjūtsu Grades (段位)'
ja_jp: サイバー術位（段位）

source: Cyber Moral Code (Saibā-dō) サイバー道
fr_fr: French Translation of 'Cyber Moral Code (Saibā-dō) サイバー道'
ja_jp: サイバー道徳規範（サイバー道）

source: Moral Code describe how practitioner (Saibā-jūtsu-ka) サイバー述家 behave and shape his inner state for practicing Cyberjūtsu (Saibā-jūtsu)サイバー述.
ja_jp: 道徳規範は、プラクティショナー（サイバー術家）の振る舞いと内面を整える方法を記述し、サイバー術の実践に役立てられます（サイバー術）。

source: Courage (Yuki) 勇気
fr_fr: French Translation of 'Courage (Yuki) 勇気'
ja_jp: 勇気

source: Sincerity (Makato) 誠
fr_fr: French Translation of 'Sincerity (Makato) 誠'
ja_jp: 誠

source: Etiquette (Reigi) 礼儀
fr_fr: French Translation of 'Etiquette (Reigi) 礼儀'
ja_jp: 礼儀

source: Honor (Meiyo) 名誉
fr_fr: French Translation of 'Honor (Meiyo) 名誉'
ja_jp: 名誉

source: Humility ([Kenkyo](https://interculturalwordsensei.org/kenkyo/)) 謙虚
fr_fr: French Translation of 'Humility ([Kenkyo](https://interculturalwordsensei.org/kenkyo/)) 謙虚'
ja_jp: 謙虚

source: Self-control (Shisei) 自制
fr_fr: French Translation of 'Self-control (Shisei) 自制'
ja_jp: 自制

source: Mutual Aid (Gojo) 互助
fr_fr: French Translation of 'Mutual Aid (Gojo) 互助'
ja_jp: 互助

source: Perseverance (Nintai) 忍耐
fr_fr: French Translation of 'Perseverance (Nintai) 忍耐'
ja_jp: 忍耐

source: Integrity (Sessō) 節操
fr_fr: French Translation of 'Integrity (Sessō) 節操'
ja_jp: 節操

source: Kindness (Kojo) 厚情
fr_fr: French Translation of 'Kindness (Kojo) 厚情'
ja_jp: 厚情

source: Cyberjūtsu short discovery course for http://thcon.party 2024
fr_fr: French Translation of 'Cyberjūtsu short discovery course for http://thcon.party 2024'
ja_jp: http://thcon.party 2024のためのサイバー術短期発見コース

source: Greeting
fr_fr: French Translation of 'Greeting'
ja_jp: 挨拶

source: The cyberjutsuka before practicing with someone greet him with physical bow called Ritsu [Rei](./glossary.md#rei) or "Onegaishimasu" sentence
ja_jp: 他の人とサイバー術を行う前に、サイバー術家はリツ礼または「お願いします」という言葉とともに、物理的なおじぎをします

source: Warmup
fr_fr: French Translation of 'Warmup'
ja_jp: ウォームアップ

source: Eyes
fr_fr: French Translation of 'Eyes'
ja_jp: 目

source: look at top right, bottom left, bottom right, top left (x5)
fr_fr: French Translation of 'look at top right, bottom left, bottom right, top left (x5)'
ja_jp: 右上、左下、右下、左上を見る（5回）

source: draw a circle with your Eyes both sens (x5)
fr_fr: French Translation of 'draw a circle with your Eyes both sens (x5)'
ja_jp: 両目で円を描く（5回）

source: draw an infinity sign with your eyes (∞) (x5)
fr_fr: French Translation of 'draw an infinity sign with your eyes (∞) (x5)'
ja_jp: 目で∞印を描く（5回）

source: Hands
fr_fr: French Translation of 'Hands'
ja_jp: 手

source: Roll your fingers one by one foreward and backward both hands (x5)
fr_fr: French Translation of 'Roll your fingers one by one foreward and backward both hands (x5)'
ja_jp: 両手の指を前後に5回、1本ずつ回す

source: touch with thumb each of your fingers both hands foreward and backward (x2)
ja_jp: 両手の指毎に親指で触る（前後）（2回）

source: join same finger of each hand with the other, then dismiss couple one by one foreward and ackward (x2)
ja_jp: 同じ指同士をくっつけてから、前後に1つずつ離す（2回）

source: listen to Sensei number (1 to 5) and dismiss related fingers
fr_fr: French Translation of 'listen to Sensei number (1 to 5) and dismiss related fingers'
ja_jp: 先生の数字（1から5）に関連した指を覚えて片手を離す

source: Combined
fr_fr: French Translation of 'Combined'
ja_jp: まとめ

source: with partner tori move fingers, uke must follow with the eyes
fr_fr: French Translation of 'with partner tori move fingers, uke must follow with the eyes'
ja_jp: パートナーと一緒に、とり指を動かし、受けは目で追う

source: Yomi Waza
fr_fr: French Translation of 'Yomi Waza'
ja_jp: 読み技

source: Yakusoku geiko
fr_fr: French Translation of 'Yakusoku geiko'
ja_jp: 約束稽古

source: *Tori* try to scan ports one by one randomly and *Uke* try to guess the number. After a while roles are exchanged.
ja_jp: *とり*はランダムに1つずつポートをスキャンし、*受け*はその数字を当てる。しばらくしてから役割が交代する

source: Log Monitoring
fr_fr: French Translation of 'Log Monitoring'
ja_jp: ログ監視

source: Tori and Uke split screen with two cli.
fr_fr: French Translation of 'Tori and Uke split screen with two cli.'
ja_jp: トリとウケが2つのcli画面を分割する

source: Press return if paragraph is prompted. *Ctrl+a* then *Ctrl+|* #split screen in two part. *Ctrl+a* then *Tab* to switch to next part of the screen. *Ctrl+a* then *Ctrl+c* to create bash cli in black part of the screen.
ja_jp: パラグラフが提示されたらリターンキーを押してください。*Ctrl+a*、*Ctrl+|*を押して画面を2つに分割します。

source: Launch Yomi Waza Log Monitoring.
fr_fr: French Translation of 'Launch Yomi Waza Log Monitoring.'
ja_jp: 読み技ログ監視を開始してください。

source: *Ctrl+a* then *Tab* to return to available cli.
fr_fr: French Translation of '*Ctrl+a* then *Tab* to return to available cli.'
ja_jp: *Ctrl+a*、*Tab*を押して利用可能なcliに戻ります。

source: Remote Terminal Session Detection [D3-RTSD](https://d3fend.mitre.org/technique/d3f:RemoteTerminalSessionDetection)
ja_jp: リモートターミナルセッション検出（https://d3fend.mitre.org/technique/d3f:RemoteTerminalSessionDetection）

source: Uke
fr_fr: French Translation of 'Uke'
ja_jp: *受け*

source: *Uke* scan port to *Tori* cyberdeck to identify ssh port
fr_fr: French Translation of '*Uke* scan port to *Tori* cyberdeck to identify ssh port'
ja_jp: *受け*は*とり*のサイバーデッキのsshポートをスキャンして特定する

source: *Uke* connect via ssh to *Tori* cyberdeck
fr_fr: French Translation of '*Uke* connect via ssh to *Tori* cyberdeck'
ja_jp: *受け*はssh経由で*とり*のサイバーデッキに接続

source: then run commands during *Tori* practice.
fr_fr: French Translation of 'then run commands during *Tori* practice.'
ja_jp: その後、*とり*の練習中にコマンドを実行する

source: examples:
fr_fr: French Translation of 'examples:'
ja_jp: 例：

source: Tori
fr_fr: French Translation of 'Tori'
ja_jp: *とり*

source: *Tori* look at Yomi Waza Log Monitoring to catch *Uke* ssh connection (from right side of the screen).
ja_jp: *とり*は右側の画面で*受け*のssh接続をキャッチするために読み技ログ監視を見る。

source: *Tori* list active sessions to identify TTY related to *Uke* ssh connection.
ja_jp: *とり*はアクティブなセッションをリストし、*受け*のssh接続に関連するTTYを識別します。

source: Process Termination [D3-PT](https://d3fend.mitre.org/technique/d3f:ProcessTermination/)
ja_jp: プロセスの終了（https://d3fend.mitre.org/technique/d3f:ProcessTermination/）

source: *Tori* look at Yomi Waza Log to catch *Uke* ssh connection (from right side of the screen).
ja_jp: *とり*は右側の画面で*受け*のssh接続をキャッチするために読み技ログを見ます。

source: *Tori* list processes to identify PID related to TTY with STAT value starting with `Ss`.
ja_jp: *とり*はプロセスをリストし、STAT値が`Ss`で始まるTTYに関連するPIDを識別します。

source: *Tori* kill the processus by it reference identifier (PID), so the session, so disconnect *Uke* from his cyberdeck.
ja_jp: 照会識別コード（PID）によりプロセスを終了し、それによりセッションを切断し、*受け*をサイバーデッキから切断します。

source: Uke performs connection
fr_fr: French Translation of 'Uke performs connection'
ja_jp: 受けの接続を実行します

source: Tori performs connection at the same time as Uke
fr_fr: French Translation of 'Tori performs connection at the same time as Uke'
ja_jp: サイバー道

source: Tori performs (Process Termination)[day1.md#process-termination-d3-pt] on local session of *Uke*
ja_jp: 道徳規範は、サイバー述家がサイバー述を実践するためにどのようにふるまい、内面状態を整えるかを述べています。

source: Nagekomi (x10 by exercise by partner)
fr_fr: French Translation of 'Nagekomi (x10 by exercise by partner)'
ja_jp: 勇気

source: kill local session of the uke
fr_fr: French Translation of 'kill local session of the uke'
ja_jp: 誠

source: Fake service listening
fr_fr: French Translation of 'Fake service listening'
ja_jp: 礼儀

source: *Tori* open a port to fake a service available for *Uke*
fr_fr: French Translation of '*Tori* open a port to fake a service available for *Uke*'
ja_jp: 名誉

source: *Uke* perform a connection with a fake client to the fake service of *Tori*
ja_jp: 謙虚

source: *Uke* disconnect with CTRL+c
fr_fr: French Translation of '*Uke* disconnect with CTRL+c'
ja_jp: 自制

source: Uchikomi (x10 by exercise by partner)
fr_fr: French Translation of 'Uchikomi (x10 by exercise by partner)'
ja_jp: 互助

source: *Uke* open a port, *Tori* must find the port and connect on it.
fr_fr: French Translation of '*Uke* open a port, *Tori* must find the port and connect on it.'
ja_jp: 忍耐

source: Randori
fr_fr: French Translation of 'Randori'
ja_jp: 節操

source: Try to disconnect partner from all his sessions (local and remote).
fr_fr: French Translation of 'Try to disconnect partner from all his sessions (local and remote).'
ja_jp: 厚情

source: Cooldown
fr_fr: French Translation of 'Cooldown'
ja_jp: 2024年のhttp://thcon.party向けのサイバー述の簡易発見コース

source: blinking
fr_fr: French Translation of 'blinking'
ja_jp: 挨拶

source: hands on
fr_fr: French Translation of 'hands on'
ja_jp: 物理的なお辞儀であるリッツ（礼）または「お願いします」という文を使って、サイバー述家は他の人と共に練習する前に挨拶します。

source: strech your fingers in and out of your hands
fr_fr: French Translation of 'strech your fingers in and out of your hands'
ja_jp: ウォームアップ

source: drop your hands and shake them
fr_fr: French Translation of 'drop your hands and shake them'
ja_jp: 目

source: body
fr_fr: French Translation of 'body'
ja_jp: 上右、下左、下右、上左を見ます（5回）

source: seated
fr_fr: French Translation of 'seated'
ja_jp: 両目で円を描きます（5回）

source: strech arms forward
fr_fr: French Translation of 'strech arms forward'
ja_jp: 目で∞の形を描きます（5回）

source: cross legs, put opposite hand on the leg, turn head on upper knee side, twist knee opposite to the head then invert
ja_jp: 手

source: move to the beginning of the chair, bend your back and put your hands on your hips then stretch
ja_jp: 両手を前後に指を一本ずつ転がします（5回）

source: stand up
fr_fr: French Translation of 'stand up'
ja_jp: 両手の指に親指を使って前後に触れます（2回）

source: stretch arms to the top
fr_fr: French Translation of 'stretch arms to the top'
ja_jp: 両手の同じ指同士を結合し、前後に片方ずつ離します（2回）

source: cross arms to put hands on elbow, pull with the hand on top of the elbow to the opposite side (invert)
ja_jp: 先生の数字（1から5）に従って関連する指を離します

source: pull up shoulders
fr_fr: French Translation of 'pull up shoulders'
ja_jp: 組み合わせ

source: join hands at the back on in front of your hips then extend left side of your neck then right
ja_jp: パートナーと一緒に指を動かし、受け手は目で追いかけます

source: Mokusō
fr_fr: French Translation of 'Mokusō'
ja_jp: 読み技

source: The cyberjutsuka after practicing with someone gree him with physical bow called Ritsu [Rei](./glossary.md#rei) or "Domo arigato" sentence
ja_jp: 約束稽古

source: Cyberjūtsu v1.0 Summer 2023 Day 2
fr_fr: French Translation of 'Cyberjūtsu v1.0 Summer 2023 Day 2'
ja_jp: *トリ*はランダムに1つずつポートをスキャンし、*ウケ*は数を推測します。しばらくすると役割が交代します。

source: Background
fr_fr: French Translation of 'Background'
ja_jp: ログ監視

source: Morning Judo course with [Dr Yves Cadot](http://budo2008.nifs-k.ac.jp/en/guest/cadot.html) about [Go no sen](../../glossary.md#go-no-sen) concept.
ja_jp: トリとウケは、2つのcliで画面を分割します。

source: listen to teacher number (1 to 5) and dismiss related fingers
fr_fr: French Translation of 'listen to teacher number (1 to 5) and dismiss related fingers'
ja_jp: パラグラフを促された場合はEnterキーを押します。 * Ctrl+a *、* Ctrl+| *を押して画面を分割します。 * Ctrl+a *、* Tab *を押して画面の次の部分に切り替えます。 * Ctrl+a *、* Ctrl+c *を押して、画面の黒い部分でbash cliを作成します。

source: Typing
fr_fr: French Translation of 'Typing'
ja_jp: 読み技ログ監視を開始します。

source: put your fingers on each zone of the keyboard [see picture here Chapter 1, Sub Chapter 1](https://www.wikihow.com/Type#Learning-to-Type)
ja_jp: 利用可能なcliに戻るには、* Ctrl+a *、* Tab *を押します。

source: type all alphabet letter one by one zone by zone from left to right (all key for one finger then move to next) backward and forward [see picture here Chapter 1, Sub Chapter 4](https://www.wikihow.com/Type#Learning-to-Type) (x10)
ja_jp: リモートターミナルセッション検出（D3-RTSD）

source: with above method type as fast as possible command said by the teacher then press enter read the first word on the prompted result (x10)
ja_jp: *ウケ*は、*トリ*のサイバーデッキにsshポートを特定するためにポートをスキャンします

source: w, ls, cd, ps, dir, clear, echo, history, env, who, fortune , find
fr_fr: French Translation of 'w, ls, cd, ps, dir, clear, echo, history, env, who, fortune , find'
ja_jp: *ウケ*は、sshを使って*トリ*のサイバーデッキに接続します

source: ps -aux, ls -lai, cd .., dir /*, htop
fr_fr: French Translation of 'ps -aux, ls -lai, cd .., dir /*, htop'
ja_jp: その後、*トリ*の練習中にコマンドを実行します。

source: Everyone split screen with two command line interface.
fr_fr: French Translation of 'Everyone split screen with two command line interface.'
ja_jp: 例：

source: Launch Yomi Waza Log.
fr_fr: French Translation of 'Launch Yomi Waza Log.'
ja_jp: トリ

source: Sen
fr_fr: French Translation of 'Sen'
ja_jp: *トリ*は読み技ログ監視を見て、*ウケ*のssh接続をキャッチします（画面の右側）。

source: Kōgeki Waza
fr_fr: French Translation of 'Kōgeki Waza'
ja_jp: *トリ*はアクティブなセッションをリストし、*ウケ*のssh接続に関連するTTYを識別します。

source: Credential Stuffing (T1110.004)[https://attack.mitre.org/techniques/T1110/004/]
ja_jp: プロセスの終了（D3-PT）

source: Tori perform (network service discovery)[./day1.md#network-service-discovery-t1046] on service discovered listed below. Then connect to each services with known credentials.
ja_jp: *トリ*は読み技ログを見て、*ウケ*のssh接続をキャッチします（画面の右側）。

source: ssh connection
fr_fr: French Translation of 'ssh connection'
ja_jp: *トリ*はプロセスをリストし、`Ss`で始まるSTAT値に関連するPIDを識別します。

source: `ssh -p $UKE_PORT $UKE_LOGIN@$UKE_IP_ADDRESS`
fr_fr: French Translation of '`ssh -p $UKE_PORT $UKE_LOGIN@$UKE_IP_ADDRESS`'
ja_jp: *トリ*はプロセスの参照識別子（PID）でそのセッションを終了させ、*ウケ*をサイバーデッキから切断します。

source: `ftp $UKE_IP_ADDRESS $UKE_PORT` then enter login then password
fr_fr: French Translation of '`ftp $UKE_IP_ADDRESS $UKE_PORT` then enter login then password'
ja_jp: ウケは接続を行います

source: telnet connection
fr_fr: French Translation of 'telnet connection'
ja_jp: トリはウケと同時に接続を行います

source: `telnet $UKE_IP_ADDRESS $UKE_PORT` then enter login then password
fr_fr: French Translation of '`telnet $UKE_IP_ADDRESS $UKE_PORT` then enter login then password'
ja_jp: 倫理規範は、実践者（サイバー述家）の振る舞いと内面状態を記述し、サイバー述の実践のために形作ります。

source: Uke use Yomi Waza Log Monitoring to identify Tori connections.
fr_fr: French Translation of 'Uke use Yomi Waza Log Monitoring to identify Tori connections.'
ja_jp: 勇気

source: pattern filtering
fr_fr: French Translation of 'pattern filtering'
ja_jp: 誠

source: circle ssh 2 rebound
fr_fr: French Translation of 'circle ssh 2 rebound'
ja_jp: 礼儀

source: Tori perform one connection, Uke identify connection by Yomi Waza, Uke set pattern filtering, Tori run the same connection, Uke must see only messages (log) related to the connection. First IP, then port, then service name
ja_jp: 名誉

source: Uke Waza
fr_fr: French Translation of 'Uke Waza'
ja_jp: 謙虚

source: *Uke* connect via ssh or ftp or http
fr_fr: French Translation of '*Uke* connect via ssh or ftp or http'
ja_jp: 自制

source: *Tori* look at Yomi Waza Log to catch *Uke* connection (from right side of the screen).
ja_jp: 互助

source: *Tori* list active sessions to identify process to *Uke* connection and try to kill related process.
ja_jp: 忍耐

source: ssh
fr_fr: French Translation of 'ssh'
ja_jp: 節操

source: For ssh see (Day 1 - Process Termination)[https://github.com/wocsa/cyberjutsu/blob/main/courses/summer-2023/day1.md#process-termination-d3-pt]
ja_jp: 厚情

source: ftp
fr_fr: French Translation of 'ftp'
ja_jp: 2024年のhttp://thcon.party用のCyberjūtsuの短い発見コース

source: telnet
fr_fr: French Translation of 'telnet'
ja_jp: 挨拶

source: it is not possible to find telnet session related process with *w* command or *pure-ftpwho* command netstat can help to identify connection
ja_jp: 実践者は、他の人と実践する前に、立礼（礼）または「お願いします」というフレーズで物理的なお辞儀で挨拶します

source: Connections Attempt Analysis (D3-CAA)[https://d3fend.mitre.org/technique/d3f:ConnectionAttemptAnalysis/]
ja_jp: ウォームアップ

source: Uke connect to one of 3 ports (ssh or telnet or ftp)
fr_fr: French Translation of 'Uke connect to one of 3 ports (ssh or telnet or ftp)'
ja_jp: 目

source: Tori try to identify connection of Uke and related port on *Uke* cyberdeck.
ja_jp: 右上、左下、右下、左上を見る（5回）

source: Connection Termination
fr_fr: French Translation of 'Connection Termination'
ja_jp: 両方の目で円を描く（5回）

source: Uke connect to a random service then tori perform connection termination.
ja_jp: 目で無限記号（∞）を描く（5回）

source: tournament
fr_fr: French Translation of 'tournament'
ja_jp: 手

source: multi screen each winner take other winners establish 3 remote sessions before kill the local session of the partner ip a
ja_jp: 両手の指を一つずつ前後に転がす（5回）

source: Uke choose a random port, tori find it and connect to it then send "hello". Tori must use (Network Service Discovery)[./day1.md#network-service-discovery-t1046]
ja_jp: 両手の親指でそれぞれの指に触れ、前後に動かす（2回）

source: Read file content
fr_fr: French Translation of 'Read file content'
ja_jp: それぞれの手で同じ指をくっつけ、前後に離す（2回）

source: Write file content
fr_fr: French Translation of 'Write file content'
ja_jp: 先生の指示に従って指を動かす

source: Change default port
fr_fr: French Translation of 'Change default port'
ja_jp: パートナーと指を動かし、相手は目で追随しなければならない

source: bash history
fr_fr: French Translation of 'bash history'
ja_jp: 読み技

source: Ctrl+r search keyword Ctrl+o past the command !! previous command !N the N command from the beginning !-N N command before last one
ja_jp: 約束稽古

source: first that success to reboot cyberdeck of the other with the command
fr_fr: French Translation of 'first that success to reboot cyberdeck of the other with the command'
ja_jp: *Tori*はランダムにポートをスキャンする試み、*Uke*はその番号を推測する。しばらくしてから役割を交換します。

source: cross legs, put opposite hand on the leg, turn head on upper knee side, twist knee opposit to the head then invert
ja_jp: ログの監視

source: cross arms to put hands on elbow, pull with the hand on top of the elbow to the opposit side (invert)
ja_jp: ToriとUkeは2つのCLIで画面を分割します。

source: References
fr_fr: French Translation of 'References'
ja_jp: 段落が求められたらリターンキーを押してください。 # 画面を2つに分割するには*Ctrl+a*、*Ctrl+|*で2つ目の画面に切り替えるには*Ctrl+a*、*Tab*、黒い部分にbash CLIを作成するには*Ctrl+a*、*Ctrl+c*を押してください。

source: Cyberjūtsu v1.0 Summer 2023 Day 3
fr_fr: French Translation of 'Cyberjūtsu v1.0 Summer 2023 Day 3'
ja_jp: Yomi Wazaログの監視を開始します。

source: Morning Jujitsu course with [Jean-Louis Mourlan](https://fr.linkedin.com/in/jean-louis-mourlan-30454986) about [Tsukuri Kuzushi Kake](../../glossary.md#tsukuri-kusushi-kake) concept.
ja_jp: *Ctrl+a*、*Tab*を押して利用可能なCLIに戻ります。

source: Tsukuri
fr_fr: French Translation of 'Tsukuri'
ja_jp: リモート端末セッション検出[D3-RTSD](https://d3fend.mitre.org/technique/d3f:RemoteTerminalSessionDetection)

source: loop
fr_fr: French Translation of 'loop'
ja_jp: *Uke*

source: http port change
fr_fr: French Translation of 'http port change'
ja_jp: *Uke*は*Tori*のサイバーデッキのsshポートを識別するためにポートをスキャンします

source: Uke change ports numbers of services.
fr_fr: French Translation of 'Uke change ports numbers of services.'
ja_jp: *Uke*は*Tori*のサイバーデッキにsshで接続します

source: edit config file for http
fr_fr: French Translation of 'edit config file for http'
ja_jp: その後*Tori*の実践中にコマンドを実行します。

source: add a line to listen new port
fr_fr: French Translation of 'add a line to listen new port'
ja_jp: 例：

source: save the file with *ctrl+x* then press *y*
fr_fr: French Translation of 'save the file with *ctrl+x* then press *y*'
ja_jp: *Tori*

source: edit website config file
fr_fr: French Translation of 'edit website config file'
ja_jp: *Tori*は右側の画面で*Uke*のssh接続をYomi Wazaログで把握します。

source: Batoru Rowaiaru バトル・ロワイアル
fr_fr: French Translation of 'Batoru Rowaiaru バトル・ロワイアル'
ja_jp: *Tori*は*Tori*のssh接続に関連するTTYを特定するためにアクティブなセッションをリストアップします。

source: Cyberjūtsu v1.0 Summer 2023 Day 1
fr_fr: French Translation of 'Cyberjūtsu v1.0 Summer 2023 Day 1'
ja_jp: プロセス終了[D3-PT](https://d3fend.mitre.org/technique/d3f:ProcessTermination/)

source: Introduction from WOCSA on [principle](../../principle.md). Morning Karate course with [Lionel Froidure](https://www.lionelfroidure.com/a-propos/) about [Mikiri](../../glossary.md#mikiri) concept.
ja_jp: *Tori*は右側の画面で*Uke*のssh接続をYomi Wazaログで把握します。

source: with above method type as fast as possible command said by the Sensei then press enter read the first word on the prompted result (x10)
ja_jp: *Tori*はプロセスをリストアップして、`Ss`で始まるSTAT値に関連するPIDを特定します。

source: Network Service Discovery [T1046](https://attack.mitre.org/techniques/T1046/)
ja_jp: *Tori*はそのPIDによってプロセスを終了させ、*Uke*をサイバーデッキから切断します。

source: uke
fr_fr: French Translation of 'uke'
ja_jp: *Uke*が接続を実行します

source: uke provide his cyberdeck ip address to tori
fr_fr: French Translation of 'uke provide his cyberdeck ip address to tori'
ja_jp: *Tori*が*Uke*と同時に接続を実行します

source: tori
fr_fr: French Translation of 'tori'
ja_jp: *Tori*は*Uke*のローカルセッションで[プロセスの終了](day1.md#process-termination-d3-pt)を実行します

source: *tori* try to find open ports on cyberdeck of *uke*.
fr_fr: French Translation of '*tori* try to find open ports on cyberdeck of *uke*.'
ja_jp: 勇気

source: tori identify service keywords en port numbers.
fr_fr: French Translation of 'tori identify service keywords en port numbers.'
ja_jp: 誠

source: Connection Attempt Analysis [D3-CAA](https://d3fend.mitre.org/technique/d3f:ConnectionAttemptAnalysis)
ja_jp: 礼儀

source: *tori* try to find when *uke* is performing scan
fr_fr: French Translation of '*tori* try to find when *uke* is performing scan'
ja_jp: 名誉

source: *uke* try to find open ports on cyberdeck of *tori*.
fr_fr: French Translation of '*uke* try to find open ports on cyberdeck of *tori*.'
ja_jp: 謙虚

source: *tori* try to find ip adress of *uke* in logs that are displayed on cyberdeck screen
ja_jp: 自制

source: Session Shoulder Surfing
fr_fr: French Translation of 'Session Shoulder Surfing'
ja_jp: 互助

source: *Tori* watch what *Uke* is doing in his own session using PID as reference.
ja_jp: 忍耐

source: *Tori* try to connect run the commands given by Sensei then disconnect without been observed by *Uke* After a while roles are exchanged.
ja_jp: 節操

source: *Tori* try to connect and kill local session of the Uke
fr_fr: French Translation of '*Tori* try to connect and kill local session of the Uke'
ja_jp: 厚情

source: Try to disconnect partner from all his sessions (local and remote). Try to disconnect partner two times from your cyberdeck then kill local session of the partner on his cyberdeck.
ja_jp: 2024年のhttp://thcon.party向けのサイバー術短期発見コース

source: Principle of Cyberjūtsu
fr_fr: French Translation of 'Principle of Cyberjūtsu'
ja_jp: 挨拶

source: Cyberjūtsu is a Digital Martial Art designed for Sport and Educational Purpose in the Cyberspace.
ja_jp: サイバージュツ家は、誰かと練習する前に、立礼あるいは「お願いします」という言葉を用いて挨拶をする

source: [WOCSA](http://wocsa.org) started Cyberjūtsu project in 2020 as a new way to bring to people capability to protect themselves and live better in cyberspace.
ja_jp: ウォームアップ

source: Cyberjūtsu aims to become an educational method of digital growth, mental growth, and moral growth at the same time.
ja_jp: 目

source: Cyberjūtsu is a way to train physical and mental discipline whose aim to educate everyone to have a better daily life with computer and internet. The fundamental principle of Cyberjūtsu, one that governs all the techniques of attack and defense, is that whatever the objective, it is best attained by the maximum-efficient use of mind and body for that purpose in cyberspace. To reach this maximum-efficient use we need to practice in a mutual aid. The same principle applied to our everyday activities leads to the highest and most rational digital life. Training in the techniques of Cyberjūtsu is not the only way to grasp this universal principle, but it is how we arrive at an understanding of it, and it is the means by which we attempt to make others understand it.
ja_jp: 上右、下左、下右、上左を見る（×5）

source: The principle of maximum efficiency , whether applied to the art of attack and defense or to refining and perfecting daily digital life, demands above all that there be order and harmony among people. This can be realized only through mutual aid and concession. The result is mutual welfare and benefit.
ja_jp: 両目で円を描く（×5）

source: The final aim of Cyberjūtsu practice is to to educate each of us for a better life in the cyberspace.
ja_jp: 目で∞を描く（×5）
